<details ><summary>apply for fundaztic 2025-08-11 10:01:37 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#fundaztic has been locked by PR #3
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic must be replaced
-/+ resource "oci_artifacts_container_repository" "fundaztic" {
      ~ billable_size_in_gbs = "0" -> (known after apply)
      ~ created_by           = "ocid1.user.oc1..aaaaaaaatqz6hzvcyjgkiztbzxrym7hfjvofokd4ftux3dlmyay2bqaaaxsa" -> (known after apply)
      ~ defined_tags         = {} -> (known after apply)
      ~ display_name         = "fundaztic" -> "fundaztic/" # forces replacement
      ~ freeform_tags        = {} -> (known after apply)
      ~ id                   = "ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaawxybqqsbsksrppufiexkmnakbvtlioe7ykzionyw3n6kqtbfwzla" -> (known after apply)
      ~ image_count          = 0 -> (known after apply)
      ~ layer_count          = 0 -> (known after apply)
      ~ layers_size_in_bytes = "0" -> (known after apply)
      ~ namespace            = "ax1h9bph8nyo" -> (known after apply)
      ~ state                = "AVAILABLE" -> (known after apply)
      ~ system_tags          = {} -> (known after apply)
      ~ time_created         = "2025-08-11 10:00:17.546 +0000 UTC" -> (known after apply)
      + time_last_pushed     = (known after apply)
        # (3 unchanged attributes hidden)

      ~ readme (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
oci_artifacts_container_repository.fundaztic: Destroying... [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaawxybqqsbsksrppufiexkmnakbvtlioe7ykzionyw3n6kqtbfwzla]
oci_artifacts_container_repository.fundaztic: Destruction complete after 2s
oci_artifacts_container_repository.fundaztic: Creating...
oci_artifacts_container_repository.fundaztic: Creation complete after 0s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaazsq3pd5wmrknqaqhapurv2jqglpjglkiko6w5fe7alsjivf7r2ra]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```
</details>

</details>